### Housing Market
* 이번에는 데이터를 생성해서 사용할 예정

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

In [11]:
# 길이가 100인 pandas series 3개 만들기
    # The first a random number from 1 to 4
    # The second a random number from 1 to 3
    # The third a random number from 10,000 to 30,000
s_1 = pd.Series(np.random.randint(low=1, high=4, size=100, dtype='l'))
s_2 = pd.Series(np.random.randint(low=1, high=3, size=100, dtype='l'))
s_3 = pd.Series(np.random.randint(low=10000, high=30000, size=100, dtype='l'))

# 데이터 합치기
housemkt = pd.concat([s_1, s_2, s_3], axis=1)
housemkt.head(3)

   0  1      2
0  3  2  29545
1  3  2  21650
2  1  1  17154

In [21]:
# raneme으로 열 이름 bedrs, bathrs, price_sqr_meter 으로 바꾸기
housemkt.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)
housemkt.head(3)

   bedrs  bathrs  price_sqr_meter
0      3       2            29545
1      3       2            21650
2      1       1            17154

In [28]:
# s_1, s_2, s_3 을 세로로 죽 이어 붙여서 bigcolumn 으로 만들기
bigseries = pd.concat([s_1, s_2, s_3], axis=0)
# to_frame 으로 시리즈 df로 변환
bigcolumn = bigseries.to_frame()
print(type(bigcolumn))
print(bigcolumn.shape)
bigcolumn.tail(3)
# tail의 index가 99인 것이 이상함 다음 셀에서 수정

<class 'pandas.core.frame.DataFrame'>
(300, 1)

        0
97  18831
98  27594
99  10511

In [29]:
# index reset 해주기
bigcolumn.reset_index(drop=True, inplace=True)
display(bigcolumn.head())
display(bigcolumn.tail())

   0
0  3
1  3
2  1
3  3
4  3

         0
295  12353
296  15848
297  18831
298  27594
299  10511